---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.IPointCloudEngine.Free
source: html/8ab4ee5f-af6d-c452-a7e8-fa8f60f15779.htm
---
# Autodesk.Revit.DB.PointClouds.IPointCloudEngine.Free Method

Revit will call this method when done using the engine.

## Syntax (C#)
```csharp
void Free()
```